# FieldDomainPointsByUV Properties

---
The FieldDomainPointsByUV type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FieldDomainPoints)
Top
#### Reference
FieldDomainPointsByUV Class
Autodesk.Revit.DB.Analysis Namespace